---
kind: method
id: M:Autodesk.Revit.DB.WorksharingSaveAsOptions.Dispose
source: html/22a98c6d-213b-8ab9-b270-b83d42c792b6.htm
---
# Autodesk.Revit.DB.WorksharingSaveAsOptions.Dispose Method

Releases all resources used by the WorksharingSaveAsOptions

## Syntax (C#)
```csharp
public void Dispose()
```